app/views/users/my_goods.html.erb

                    <td align = "center">
                        <% vevő = "Vevő: " + User.find_by_id(g.buyer_id).username %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]