app/views/goods/landing.html.erb

            <td align = "right">
                <strong> <%= User.find_by_id(session[:user_id]).username %> </strong>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]