app/views/goods/new.html.erb

SELECT "categories".* FROM "categories"
---
<%if @categories.nil?%>
  <%@categories=Category.all%>