app/controllers/eschop_controller.rb

    def list
        @goods = Good.all
---
SELECT "goods".* FROM "goods"