app/controllers/goods_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def find_sellers_for_goods(goods)
    seller_ids=[]
    goods.each do|good|
      seller_id=good.seller_id
      unless  seller_ids.include?(seller_id)
        seller_ids.push(seller_id)
      end
    end
    User.where(id:seller_ids)