app/controllers/goods_controller.rb

    def index
        @goods = Good.all
---
SELECT "goods".* FROM "goods"

    def show
        @good = Good.find(params[:id])
        @user = User.find_by_id(@good.seller_id)
---
SELECT  "goods".* FROM "goods" WHERE "goods"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        @good = Good.new(good_params)
        @good.seller_id = session[:user_id]
        if @good.save
---
INSERT INTO "goods" ("name", "price", "description", "category_id", "seller_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "Hotdog"], ["price", 350], ["description", "Meleg kutya"], ["category_id", 1], ["seller_id", 5], ["created_at", "2019-04-21 14:02:56.420241"], ["updated_at", "2019-04-21 14:02:56.420241"]]

    def destroy
        @good = Good.find(params[:id])
        @good.destroy
---
SELECT  "goods".* FROM "goods" WHERE "goods"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
DELETE FROM "goods" WHERE "goods"."id" = $1  [["id", 9]]

    def to_cart
      good = Good.find(params[:id])
      error = false
      if good.seller_id === session[:user_id]
        error = true
      elsif good.update_attributes(:buyer_id => session[:user_id])
---
SELECT  "goods".* FROM "goods" WHERE "goods"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "goods" SET "buyer_id" = $1, "updated_at" = $2 WHERE "goods"."id" = $3  [["buyer_id", 5], ["updated_at", "2019-04-21 19:14:11.015614"], ["id", 4]]

    def back_from_cart
      if Good.find(params[:id]).update_attributes(:buyer_id => nil)
---
SELECT  "goods".* FROM "goods" WHERE "goods"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
UPDATE "goods" SET "buyer_id" = $1, "updated_at" = $2 WHERE "goods"."id" = $3  [["buyer_id", nil], ["updated_at", "2019-04-21 19:08:06.504846"], ["id", 16]]