app/controllers/users_controller.rb

    def create
        @user = User.new(create_params)
        @users = User.all
        @error = false

        @users.each do |u|
            if u.username === @user.username && u.roomnumber === @user.roomnumber
                @error = true
            end
        end
        if @error == false && @user.save
---
SELECT "users".* FROM "users"
INSERT INTO "users" ("username", "password_digest", "roomnumber", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

    def show
        @user = User.find_by_id(session[:user_id])
        @goods = Good.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "goods".* FROM "goods"

    def good_show
        @good = Good.find(params[:id])
---
SELECT  "goods".* FROM "goods" WHERE "goods"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]

    def edit
        @user = User.find_by_id(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

    def update
        @user = User.find_by_id(session[:user_id])

        if @user.update_attributes(edit_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "roomnumber" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["username", "Borika"], ["roomnumber", 1000], ["updated_at", "2019-04-21 20:05:21.158000"], ["id", 5]]

    def pass_update
        @user = User.find_by_id(session[:user_id])
        if @user.update_attributes(pass_edit_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "$2a$10$DYYy3shhwwsYfKp3uK3eSuu.ng/tLvfc.4ipUBQmllwYqHHD8VHL2"], ["updated_at", "2019-04-21 20:10:03.947419"], ["id", 5]]

    def my_cart
        @goods = Good.all
---
SELECT "goods".* FROM "goods"

    def my_goods
        @goods = Good.all
---
SELECT "goods".* FROM "goods"

    def show_buyer
        @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]